app/views/collections/index.html.erb

<script type="text/javascript">
$(window).bind('load', function() {
   $('#menu1').menuTree({
        parentMenuTriggerCallback: true
    }, function(url){
     // console.log(2, arguments, this);
     $.get(url, {}, function(data) {
        console.log(data);
        if (data.status == 'success') {
          var list = data.assets;
          var html = '';
          $.each(list, function(idx, v) {
            var obj = v.asset || {};
            html += '<li><img width="500" height="630" alt="'+obj.asset_file_name+'" src="/system/assets/'+obj.id+'/original/'+obj.asset_file_name+'" /></li>';
          });
          if (html) {
            html = '<div id="flickit" class="svwp"><ul>'+ html + '</ul></div>';
            $('#rightcontent').html(html);
            initSlideView();
            //$('#rightcontent').html('');
            // console.log(html);
          }
---
SELECT "assets".* FROM "assets" WHERE ("assets".post_id = 6)