app/views/posts/_form.html.erb

  <%= f.error_messages %>
  <%= f.collection_select :parent_id, Post.all(:order => "id"), :id, :title, :include_blank => true %>
---
SELECT "posts".* FROM "posts" ORDER BY id