app/controllers/collections_controller.rb

SELECT "assets".* FROM "assets" WHERE ("assets".post_id = 4)
SELECT "posts".* FROM "posts" ORDER BY posts.id DESC LIMIT 1
---
  def index
    @roots = Post.root_posts
    @assets = Post.first.assets

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 11 LIMIT 1
---
  def show
     post = Post.find(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 12 LIMIT 1
---
  def get_async
    post = Post.find(params[:id])