app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE ("posts".parent_id = 4)
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("created_at", "content", "parent_id", "updated_at", "isleaf", "title") VALUES ('2012-11-18 09:43:10.576813', 'first collections ', NULL, '2012-11-18 09:43:10.576813', NULL, 'Collections')
---
  def create
    @post = Post.new(params[:post])
    @post.parent_id = params[:post][:parent_id]
    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 4 LIMIT 1
UPDATE "posts" SET "content" = 'collection children', "updated_at" = '2012-11-18 12:04:48.742757' WHERE "posts"."id" = 5
---
  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(params[:post])